National_bank_xml/PRISTIGAO_RTGS.XML

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>Gii6J/XclDl2TYAJ6vM6F8ue+Tf2DCMFQv7Z1juQEVlMv3POw//ndtYVwyKhbSoDK19mgEmFIbev&#13;
BwSsDoqeR5+eWI9GMbuIx28Ohu6NZrRaqXl7rR8ZQxhRwNSrEwHfMGTR6wZymNTCEdmDyFkbJaRe&#13;
UqPEKefzC7GocDUyLoxtzly8X8dLIfPXMN7CcXQn538lMq3OSb6t6EUiwdvOYZ+0t6Iw2fYhaz5Z&#13;
49H9IbJ06bpp3B1b7axvCdVRHoo1OBtoVzgV7CTCGA0IOBdGF+VBLiOIurdzzMFlXO2W+QFy/uss&#13;
M5XZOzhKFXlD3k8ELNegpC9EkDig51sdyoqiPQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>fJJ3/3uIfEvrbAlyWfChH4Ud2/NsYiVt1G5sgA8Ww9NngAt3C3GOmjxW3FIQ8nMMljiB0/U3bGe5&#13;
/Pd/T7krw/bwwNZCY4pVZO1iS5a6DljUhtsnZK43SfZBlIGBzFN2JFdiBzP4Lh0Sk3mhkch2POoe&#13;
9l66kpNYuOdEhWscoSABgK1jIWxFeIRqJM3IVTgxC6JrDCtjm0m4tpLFCJW5gFaKLqnRNd9Atvzu&#13;
hRV0/JpaxK4DKJ3seAojbVOVtlvtn8p/Zma61JGpd0+7m9e3a8UzPA2nNMpwJKA2y551OhJSbWp/&#13;
rIggLJOIQn7aiWJjxiniGl2Tx25luTtRgdZQ5kc0qRJXJ9igDiQzkCbV7As/JPmSUaMpAZuoVXZs&#13;
lfZrjhImp2YlxUkq4Ee2tzCQyWGP84v42y8GdQorT+T8TH3TCGCT5OrBfWHiU/lV4oryA3ZuYnsc&#13;
DZzLAKpbKGYmN6z1z3jjetMKfseOsl27znSviPJjyVAAquu9/BppKEpNywzBoIy1lRo21udDexlR&#13;
4ggMCbnmxentx8HeOuDTgfjm6JBFTr2QFYSeCeMOq+rnuAcO/pNE2K8xxRc64c1eTI7gCta/nZ+X&#13;
fSeDiTe8sQXUgwv6pS7CTjDLebtSP6L1rFyb5jK7UUoSoiyZ7y+AoNvBSINJuVMLoj98sHKfA4ce&#13;
BYjZNfrJYhPlkAzZXF4uT9qnKr2mLIr0puH6g7PHZCJb6TRE/zA3hfZ3M3D5tpmX3TTXXohBpv5G&#13;
bsruTP1gpXFN5/yG8h9IVxOI82pX13CQj3iQFR77AILXKKjbN4+Tlpko5kZcNpZk4Ukyr+prj6IP&#13;
ImWt2UU1Bibk1Dw/tbV5gQjVHQmCmcSF12IbliZWYkWxDzOI56UM0UZt/8s6UlR3ddXpVQTiCH9B&#13;
3rNA1wFbWHk8vD2hBbUsAWgoQRJCu7JFKP2SMIeqEim7/lpN5DYsD8SkRN+7NZLc8UrFw16w88A4&#13;
OjElXfpL3/EG5B6kFcbTSy9ZKQUE/AU7fBLtaB9DcFSMd655gY92d1SdnYXsC/Wjpc3bG8A734LP&#13;
MqpZ/gP/XlZ/jndt5xYxZMWg5gMFQHefddG3gZY1A4wE7cTMlrbagEjQ/BHSV3qjnUZAgfWaRzqp&#13;
huu680LxrvhlCv2TFlw/6NTgequvz7Hh9H787hgiqVTxjiJKmaR4QKGX5VCJx2d2oMbZ6YqRSl2p&#13;
LcQCITR2bwmmC0kEq1LnAwIkFgkoZ4eg5R8z0VGzOUWMNgqz81aeBefqNc1iLPNpd05jtPHE/yBF&#13;
yJmCCW4Ozhm6G/tL1JbpZ2gNKBWQkbvw5NRu3t8DHs/Fk0gga9OS2OgnRPT23MM=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>I5UFrIh+rfd/+gRTvwFQroTUU3I=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
ZGOqilfGxXKUejJSDp1ObnfjNLXJ2sZn/bDffgyBg9Vqhlbi30ayNIUuTq6DvBNEow8QBx4O5g3S&#13;
oNHNrbHtFuqh9qJxU6Ug+9LPczOOviAFI08qsz2jeemoboYTzNcHZXp2TybIcmDEa+sy4C0qkg8u&#13;
miXnAZP4HLsFvs9QUgNYwnUG+Ze+gXOCiAp9WDuq9JwEg7flVYUapFgStTZ3DK3ZTP4T3+L9ZL5h&#13;
KFoOTv3t8CIVauX91JWECIV882pr6hseiTOOZK8S15w+kvtKL2eY+SK2/ct+5/KFqd8NHS6/5ojC&#13;
+d/G9vyvRL2mzoGs2IrJjr07A5XMnYw6Vqhz9Q==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>